/* 範例檔名:arr_mul.c ,二個二維陣列的相乘 */
#include <stdio.h>/* 引入標頭檔 */
#include <stdlib.h>

int main(void)
{
    /* 二個二維整數陣列的宣告並設定初值 */
    int a[3][2]={{5,4},{7,8},{7,8}},
        b[2][4]={{2,3,5,1},{1,2,3,3}},
        c[3][4],/* 儲存相乘之結果陣列 */
        i,j,k;/* 計數用之變數 */

    /* 設定 c 陣列之初值為 0 */
    for(i=0;i<3;i++)
        for(j=0;j<4;j++)
            c[i][j]=0;

    for(i=0;i<3;i++){
        for(j=0;j<4;j++){
            for(k=0;k<2;k++){
                /* a 與 b 的陣列元素相乘並加總 */
                c[i][j] += ( a[i][k]*b[k][j] );
            }

            /* 陣列元素的顯示 */
            printf("c[%d][%d]=%-2d ",i,j,c[i][j]);
        }
        printf("\n");
    }

    system("PAUSE");/* 暫停程式執行 */
    return 0;/* <-程式正常結束，傳回0 */
}
