/* 範例檔名:logiexam.c ,邏輯運算式之範例 */
#include <stdio.h>/* 引入標頭檔 */
#include <stdlib.h>

int main(void)
{
    int A=3,B=9;/* 宣告變數並設定初值 */

    /* 進行邏輯運算並輸出結果 */
    /* 範例一，結果為0(假)*/
    printf("(!(A >= B)) && (A==B) is %d\n",(!(A >= B)) && (A==B));

    /* 範例二，結果為1(真)*/
    printf("((A != B) || (A==B)) && (A < B) is %d\n",
            ((A != B) || (A==B)) && (A < B));

    /* 範例三，結果為0(假)*/
    printf("1 && 0 && 1 is %d\n",1 && 0 && 1);

    /* 範例四，結果為1(真)*/
    printf("1 || !1 || 1 is %d\n",1 || !1 || 1);

    /* 範例五，結果為1(真)*/
    printf("1 || 1 && 0 is %d\n",1 || 1 && 0);

    system("PAUSE");/* 暫停程式執行 */
    return 0;/* <-程式正常結束，傳回0 */
}
